def stock(name): 
    stock = {'한화투자증권':'003530', '두산중공업':'034020', '삼성전자':'005930', 
            '엔씨소프트':'036570', '현대제철': '004020', 'POSCO':'005490',
            'SBS':'034120','SK아이테크놀로지':'361610','SK바이오사이언스':'302440',
            'SK':'034730','LG유플러스':'032640','LG디스플레이':'034220',
            'LG':'003550','삼성생명':'032830','삼성바이오로직스':'207940',
            '삼성엔지니어링':'028050','삼성에스디에스':'018260','삼성물산':'028260',
            '삼성SDI':'006400','삼성증권':'016360','삼성중공업':'010140'}
    return stock[name]